<script setup lang="ts">
import type {Product} from "~/repository/community/types";
const props = defineProps<{
  product:Product
}>()

const communityStore = useCommunityStore()
const {currentCommunity} = storeToRefs(communityStore)


</script>

<template>
<CardBase>
  <div class="relative mb-5">
    <Button v-if="currentCommunity?.is_owner" icon="pi pi-pencil" @click="navigateTo(`/group/${currentCommunity.slug}/products/${product.slug}/edit`)"/>

    <img v-if="product.cover" class="rounded-lg w-full h-[300px] object-cover block " :src="product.cover" alt="">
<!--    <p class="bottom-3 left-3 absolute bg-secondary text-white font-medium text-sm px-2 py-1 inline-block rounded-lg">Распродажа</p>-->
  </div>
  <div class="p-3">
    <p class="text-[20px] font-semibold mb-3">{{product.title}}</p>
    <p class="text-md leading-[130%] mb-[18px]">
      {{product.short_description}}
    </p>

    <div class="flex flex-wrap gap-2 w-full">
      <UIButton variant="outline" :label="product.price ?  `Доступ за ${product.price}₽` : 'Беслатно'"/>

      <nuxt-link :to="`/group/${currentCommunity?.slug}/products/${product.slug}`">
        <UIButton label="Подробнее" extra-class="w-full"/>
      </nuxt-link>
      <UIButton variant="outline" >
        <template #icon_left>
          <svg width="21" height="19" viewBox="0 0 21 19" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10.6558 18.8379C10.3945 18.9871 10.0733 18.9872 9.81207 18.8379L10.2339 18.0996L10.6558 18.8379ZM15.1089 0C17.3995 0 19.3789 1.59608 20.1343 3.8623C20.9009 6.16223 20.4132 9.09207 18.0044 11.9023C15.7274 14.559 13.9138 16.279 12.6578 17.3418C12.0298 17.8732 11.5413 18.2409 11.2037 18.4785C11.0349 18.5973 10.9039 18.6838 10.8121 18.7422C10.7662 18.7714 10.7297 18.7938 10.7037 18.8096C10.6908 18.8173 10.6804 18.8235 10.6724 18.8281C10.6686 18.8304 10.6653 18.8324 10.6627 18.834L10.6568 18.8369L10.2339 18.0996C9.84535 18.7796 9.81473 18.8329 9.81207 18.8369H9.81109L9.81011 18.8359C9.80908 18.8353 9.80755 18.8348 9.80621 18.834C9.80355 18.8324 9.80029 18.8304 9.79644 18.8281C9.78843 18.8234 9.77723 18.8174 9.76422 18.8096C9.73812 18.7938 9.70173 18.7714 9.65582 18.7422C9.56401 18.6838 9.43291 18.5972 9.26422 18.4785C8.92654 18.2409 8.43807 17.8731 7.81011 17.3418C6.55406 16.279 4.7404 14.5588 2.46343 11.9023C0.0548415 9.09208 -0.432071 6.16219 0.334527 3.8623C1.08991 1.59616 3.06846 0.00010811 5.35894 0C7.63073 0 9.07703 1.37903 9.90972 2.62793C10.029 2.80691 10.1358 2.98674 10.2339 3.16113C10.3321 2.98667 10.4388 2.80698 10.5582 2.62793C11.3908 1.37902 12.8372 9.41931e-05 15.1089 0ZM15.1089 1.69922C13.6311 1.69931 12.6395 2.57033 11.9722 3.57129C11.6408 4.06844 11.409 4.57173 11.2603 4.9541C11.1865 5.14378 11.1351 5.30077 11.1021 5.40723C11.0857 5.4602 11.074 5.50088 11.0669 5.52637C11.0634 5.53909 11.0604 5.54875 11.0591 5.55371L11.0582 5.55469L11.0591 5.55566C10.9645 5.93406 10.624 6.19922 10.2339 6.19922C9.844 6.19911 9.5043 5.93398 9.40972 5.55566V5.55762L9.40191 5.52637C9.39483 5.50089 9.38318 5.46029 9.36675 5.40723C9.3338 5.30077 9.28137 5.14387 9.20757 4.9541C9.05883 4.57169 8.82708 4.06844 8.49566 3.57129C7.82832 2.57028 6.83695 1.69922 5.35894 1.69922C3.89967 1.69933 2.50394 2.72836 1.94683 4.39941C1.401 6.0369 1.66339 8.35731 3.75445 10.7969C5.97724 13.3901 7.72637 15.0453 8.90777 16.0449C9.49233 16.5396 9.93872 16.8729 10.2339 17.0811C10.5291 16.8729 10.9755 16.5396 11.5601 16.0449C12.7415 15.0453 14.4907 13.39 16.7134 10.7969C18.8045 8.35731 19.0679 6.0369 18.522 4.39941C17.9649 2.72818 16.5683 1.69922 15.1089 1.69922Z" fill="black"/>
          </svg>

        </template>
      </UIButton>


    </div>
  </div>

</CardBase>
</template>

<style scoped>

</style>